import React from 'react';
import {Container, Text} from 'native-base';
import {ScrollView, StyleSheet} from "react-native";

class TermsService extends React.Component {
    render() {
        return (
            <Container>
                <ScrollView style={{backgroundColor: '#ffffff', padding:10}}>
                    <Text style={styles.textHeader}>MBA 라운지 서비스 이용약관</Text>
                    <Text>약관을 통해 라운지(이하 ‘회사’)와 회원(이하 ‘회원’)과의 권리, 의무 및 책임사항, 기타 사항을 확인하실 수 있으며 회사는 이 약관의 내용을 회원이 쉽게 확인할 수 있도록 서비스 내 게시합니다.</Text>
                    <Text style={styles.textHeader}>약관에서 사용되는 용어의 정의와 해석은 다음과 같습니다.</Text>
                    <Text>서비스는 MBA 라운지를 의미합니다. 회원은 회사의 서비스에 접속하여 이 약관에 따라 회사와 이용계약을 체결하고 회사가 제공하는 서비스를 이용하는 고객을 말합니다. 콘텐츠는 회원이 서비스 이용 시 서비스 상에 게시한 부호 · 문자 · 음성 · 음향 · 동영상 등의 정보 형태의 글, 사진, 동영상 및 각종 파일과 링크 등을 의미합니다.</Text>
                    <Text style={styles.textHeader}>약관은 회원이 쉽게 알 수 있도록 게시하며 사전 공지 후 개정합니다.</Text>
                    <Text>회사는 약관의 내용을 회원이 쉽게 알 수 있도록 서비스 내 또는 연결화면에 게시하며, 관련법령을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다. 회사가 약관을 개정할 경우에는 개정하는 이유와 적용일자를 명시하여 현행약관과 함께 서비스 내 공지합니다.</Text>
                    <Text>회사가 개정약관으로 공지한 내용에 대해 공지하였음에도 회원이 명시적으로 거부 의사표시를 하지 않은 경우, 회사는 회원이 개정약관에 동의한 것으로 봅니다. 회원이 개정약관의 적용에 동의하지 않는 경우 회사는 개정약관의 내용을 적용할 수 없으며, 이 경우 회원은 이용계약을 해지할 수 있습니다. 다만, 기존 약관을 적용할 수 없는 특별한 사정이 있는 경우에는 회사는 회원과의 이용계약을 해지할 수 있습니다. 이 약관의 일부가 적용할 수 없는 내용으로 결론지어지더라도 나머지 부분은 계속해서 효력을 갖습니다.</Text>
                    <Text style={styles.textHeader}>약관과 운영정책은 상호 보완됩니다.</Text>
                    <Text>회사는 서비스에 대해서는 별도의 이용약관 및 운영정책(이하 "운영정책 등")을 둘 수 있습니다. 이 약관에서 정하지 아니한 사항이나 해석에 대해서는 별도의 운영정책, 관계법령 또는 상관례에 따릅니다.</Text>
                    <Text style={styles.textHeader}>서비스의 실제 이용까지는 몇가지 절차를 거치게 됩니다.</Text>
                    <Text>회사는 서비스에 대해서는 별도의 이용약관 및 운영정책(이하 "운영정책 등")을 둘 수 있습니다. 이 약관에서 정하지 아니한 사항이나 해석에 대해서는 별도의 운영정책, 관계법령 또는 상관례에 따릅니다.</Text>
                    <Text style={styles.textHeader}>서비스의 실제 이용까지는 몇가지 절차를 거치게 됩니다.</Text>
                    <Text>이용계약은 회원이 되고자 하는 자(이하 "가입신청자")가 약관의 내용에 대하여 동의를 한 다음 회원가입신청을 하고 회사가 이러한 신청에 대하여 승낙함으로써 체결됩니다. 회사는 가입신청자의 신청에 대하여 서비스 이용 승낙을 원칙으로 합니다. 다만, 회사는 다음 몇가지 경우에 대하여 승낙을 하지 않거나 사후에 이용계약을 해지할 수 있습니다. 첫번째로 가입신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우로 이 때 회사의 회원 재가입 승낙을 얻은 경우는 예외로 합니다. 둘째로 허위의 정보를 기재하거나, 회사가 제시하는 내용을 기재하지 않은 경우가 해당됩니다. 셋째로 회원의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하며 신청하는 경우입니다.</Text>
                    <Text>그 밖에도 회사에 서비스 관련설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다.</Text>
                    <Text>이 내용에 따라 회원가입신청의 승낙을 하지 않거나 유보한 경우, 회사는 원칙적으로 이를 가입신청자에게 알려드립니다. 이용계약의 성립 시기는 회사가 가입완료를 신청절차 상에서 표시한 시점으로 하며, 회사는 회원을 서비스 정책에 따라 등급별로 구분하여 이용시간, 이용횟수, 서비스 메뉴 등을 세분하여 이용에 차등을 둘 수 있습니다.</Text>
                    <Text style={styles.textHeader}>회원은 언제든 개인정보를 변경할 수 있습니다.</Text>
                    <Text>회원은 프로필 설정 화면을 통하여 언제든지 본인의 개인정보를 열람하고 수정할 수 있으며 회원가입신청 시 기재한 사항이 변경되었을 경우 프로필을 수정하여 회사에 그 변경사항을 알려야 합니다. 특히, 휴대전화 번호를 변경하거나 비활성화할 경우에는 48시간 내에 회원 계정 정보를 업데이트해야 합니다. 그렇지 않은 경우 회원의 기존 휴대전화 번호를 습득한 자에게 회원의 콘텐츠가 전송될 수 있습니다. 변경사항을 회사에 알리지 않아 발생한 불이익에 대해 회사는 책임지지 않습니다.</Text>
                    <Text style={styles.textHeader}>회원의 개인정보를 보호하기 위해 노력합니다.</Text>
                    <Text>회사는 관계 법령이 정하는 바에 따라 회원의 개인정보를 보호하며, 개인정보의 보호 및 사용에 대해서는 관련법 및 서비스의 개인정보처리방침이 적용됩니다. 다만, 아동음란물을 유포했거나 대량의 음란물 유포가 확인된 경우 및 생명이 위급하다고 판단되는 콘텐츠 내용이 발견될 경우에 한 해 회사는 개인정보처리방침과는 별도로 관련 정보를 수사기관에 제공할 수 있습니다. 또한 회사는 관계 법령이나 약관의 준수 여부 등을 확인할 필요가 있을 때 게시물 내용을 확인할 수 있으며, 관계 법령에 따라 게시물 또는 대화 내용을 수사기관에 제공할 수 있습니다.</Text>
                    <Text>회원이 서비스를 이용하기 위해 일정 기간 동안 로그인 혹은 접속한 기록이 없는 경우, 전자메일, 서비스 내 알림 또는 기타 적절한 전자적 수단을 통해 사전에 안내해 드린 후 회원의 정보를 파기하거나 분리 보관할 수 있으며, 계속해서 서비스에 접속하지 않는 경우 관련 서비스 이용계약을 해지할 수 있습니다.</Text>
                    <Text>회사의 개인정보처리방침은 공식 사이트 이외의 링크된 사이트에서는 적용되지 않습니다.</Text>
                    <Text style={styles.textHeader}>중요한 내용을 잘 안내하고 회원의 의견도 적극적으로 수용합니다.</Text>
                    <Text>회사가 회원께 중요 내용을 통지를 하는 경우, 이 약관에 별도 규정이 없는 한 서비스 내 알림 또는 기타 회사가 적당하다고 판단하는 방법으로 할 수 있습니다.</Text>
                    <Text>서비스 이용과 관련하여 회원이 제기하신 의견이나 불만이 정당하다고 인정할 경우에도 이를 처리하기 위해 노력합니다. 회원이 제기한 의견이나 불만사항에 대해서는 회사가 적당하다고 판단하는 방법 등을 통하여 회원께 처리과정 및 결과를 전달합니다.</Text>
                    <Text style={styles.textHeader}>개별 게시판과 콘텐츠는 유형에 따라 운영방식 및 노출 범위가 달라집니다.</Text>
                    <Text>게시판 스텝은 게시판의 멤버 가입을 승인 또는 거부할 수 있으며, 이후에도 활동 중인 멤버를 탈퇴시킬 수 있습니다. 또한 스텝은 멤버가 게시판 내에 게시하여 타인과 공유하고자 하는 게시물을 사전 또는 사후 삭제할 수 있는 편집기능을 활용할 수 있습니다.</Text>
                    <Text>게시판별 특성 또는 설정에 따라 등록된 컨텐츠는 일정기간 이후 삭제될 수 있습니다. 또한 게시판 활동성에 따라 저장공간이 차등 제공되며, 저장공간이 가득 차면 공간확보를 위해 오래된 첨부내용이 삭제될 수 있습니다.</Text>
                    <Text style={styles.textHeader}>서비스 및 게시자의 권리를 존중해 주시기 바랍니다.</Text>
                    <Text>회원이 서비스 내에 게시한 게시물의 저작권은 해당 게시물의 저작자에게 귀속됩니다. 서비스에 대한 저작권 및 지적재산권은 회사에 귀속되며 이 때 회원이 작성하신 게시물 및 제휴계약에 따라 제공된 저작물 등은 제외합니다. 회사가 제공하는 서비스의 디자인, 회사가 만든 텍스트, 스크립트(script), 그래픽, 상호간 전송 기능 등 회사가 제공하는 서비스에 관련된 모든 상표, 서비스 마크, 로고 등에 관한 저작권 및 기타 지적재산권은 관련법령에 기하여 회사가 보유하고 있거나 회사에게 소유권 또는 사용권이 있습니다.</Text>
                    <Text>회사는 서비스와 관련하여 회원께 회사가 정한 이용조건에 따라 서비스 등을 이용할 수 있는 이용권만을 부여하며, 회원은 이에 대한 양도, 판매, 담보제공 등의 처분행위를 할 수 없습니다. 회원은 본 이용약관으로 인하여 서비스를 소유하거나 서비스에 관한 저작권을 보유하게 되는 것이 아니라 회사로부터 서비스의 이용을 허락 받게 되는 것으로, 서비스는 정보취득 또는 개인용도로만 제공되는 형태로 이용할 수 있습니다.</Text>
                    <Text>회원은 명시적으로 허락된 내용을 제외하고는 서비스를 통해 얻어지는 회원 상태정보를 영리 목적으로 사용, 복사, 유통하는 것을 포함하여 회사가 만든 텍스트, 스크립트, 그래픽의 상호간 전송기능 등을 복사하거나 유통할 수 없습니다. 회원은 회사의 명백한 서면 허가를 받은 경우를 제외하고는 서비스 또는 이에 포함된 소프트웨어와 관련된 파생물 제작, 역파일, 소스 코드의 추출을 시도할 수 없습니다.</Text>
                    <Text style={styles.textHeader}>서비스 이용과 관련해서는 몇가지 지켜주셔야 할 부분들이 있습니다.</Text>
                    <Text>서비스의 올바른 활용을 위해 다음 행동이 서비스 내에서 금지됩니다. 회원가입 또는 정보 변경 시 허위내용을 등록하는 것, 타인의 정보를 도용하는 것, 다른 이용자의 개인정보나 등록정보 또는 이용이력 정보를 무단으로 수집하거나 공개 · 제공하는 것, 본인의 계정에 타인이 접속하도록 하는 등 계정 보안에 위험을 초래하는 것, 자신 또는 타인에게 재산상의 이익을 주거나 타인에게 손해를 가할 목적으로 허위의 정보를 유통시키는 것, 서비스를 불건전 교제 조장 · 매개하기 위한 목적으로 이용하거나 개인 또는 단체를 비방하고 명예를 훼손하는 등 서비스 목적에 어긋나게 이용하는 것들이 이에 해당합니다.</Text>
                    <Text>또한 회사에서 게시한 정보에 대한 변경 또는 회사의 동의 없이 영리를 목적으로 서비스를 사용하는 행위가 금지되며, 회사나 제 3자에 대한 사칭, 명의 도용, 저작권, 지적재산권 침해, 명예 손상, 업무 방해 등을 일으키는 행위는 허용되지 않습니다. 그 외에도 회사가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등을 송신 또는 게시하거나 외설 또는 폭력적인 메시지, 화상, 음성, 기타 미풍양속에 반하는 정보, 본인 이외의 자를 사칭하거나 허위사실을 주장하는 등 타인을 기만하는 내용을 서비스에 공개 또는 게시하는 행위가 금지됩니다.</Text>
                    <Text>위에 해당되는 모든 행위를 방조 또는 조장하는 행위나 기타 불법적이거나 부당한 행위 역시 금지 대상이며, 회원은 관계법, 이 약관의 규정, 운영정책, 이용안내 및 서비스와 관련하여 공지한 주의사항 및 회사가 통지하는 사항 등을 준수하여야 하고 기타 회사의 업무에 방해되는 행위를 하셔서는 안됩니다.</Text>
                    <Text>준수하지 않아 발생되는 모든 법적, 경제적 등의 책임은 회원에게 있습니다.</Text>
                    <Text style={styles.textHeader}>부득이하게 이용에 제한을 받으실 수 있습니다.</Text>
                    <Text>회사는 다양한 정보와 의견이 담긴 회원의 콘텐츠를 소중히 다룰 것을 약속 드리지만, 모든 콘텐츠를 확인하고 관리하지는 않습니다. 만일 회원의 콘텐츠가 관련 법령, 약관, 운영정책 등에 위배되는 경우, 이를 비공개 또는 삭제 처리하거나 등록하지 않을 수 있습니다.</Text>
                    <Text>서비스 활동 중 회원이 작성한 콘텐츠가 관련법에 위반되는 내용을 포함하는 경우 권리자는 관련법이 정한 절차에 따라 해당 콘텐츠의 게시중단 등을 요청할 수 있으며 회사는 관련법에 따라 처리합니다. 또한 권리자의 요청이 없는 경우라도 권리침해가 인정될 만한 사유가 있거나 기타 회사 정책 및 관련법에 위반되는 경우에는 관련법에 따라 해당 콘텐츠와 이러한 내용이 포함된 모임에 대해 임시조치 또는 삭제/폐쇄 등을 진행할 수 있습니다.</Text>
                    <Text>회사는 회원이 이 약관의 의무를 위반하거나 서비스의 정상적인 운영을 방해한 경우 경고, 일시정지, 영구이용정지 등의 방식으로 서비스 이용을 제한할 수 있습니다. 단, 불법프로그램의 제공 및 운영방해, 불법통신 및 해킹, 악성프로그램의 배포, 접속권한 초과행위, 기계적 활동 등과 같이 관련법을 위반한 경우 및 정상적인 서비스 이용이라 생각되지 않거나 서비스에서 금지한 방식을 시도하는 등 서비스에 대한 어뷰징(남용) 행위를 막기 위한 회사의 기술적 조치를 우회하는 일체의 행위에 대해서는 즉시 영구이용정지를 할 수 있습니다. 영구이용정지 시 서비스 이용을 통해 획득한 혜택 등도 모두 소멸되며, 회사는 이에 대해 별도로 보상하지 않습니다. 관련 제한의 조건 및 세부내용은 운영정책을 따릅니다.</Text>
                    <Text>서비스 이용을 제한하거나 계약을 해지하는 경우에는 회사는 통지 방식에 따라 알리게 되며 이 때 회원은 회사가 정한 절차에 따라 이의신청을 할 수 있습니다. 이의가 정당하다고 회사가 인정하는 경우 회사는 즉시 서비스의 이용을 재개합니다.</Text>
                    <Text style={styles.textHeader}>아동ㆍ청소년 음란물 유포 행위에 반대하며, 어떠한 경우이더라도 허용하지 않습니다.</Text>
                    <Text>회사는 미성년자로 인식될 수 있는 대상이 확인된 음란 콘텐츠가 발견될 경우 즉시 해당 콘텐츠에 대해 조치합니다. 또한 이를 게시 또는 공유한 회원에 대해 MBA 라운지 내 최고 수준의 징계를 진행할 뿐 아니라, 수사기관에 관련 정보를 제공하는 등 사법당국과 연계된 대응까지도 진행할 수 있습니다.</Text>
                    <Text style={styles.textHeader}>안정적 서비스 제공을 위해 노력합니다.</Text>
                    <Text>회사는 MBA 라운지 및 기타 회사가 추가 개발하거나 다른 회사와의 제휴계약 등을 통해 일체의 서비스를 제공합니다. 서비스는 연중무휴, 1일 24시간 제공을 원칙으로 하지만, 사전 공지 하에 서비스를 일정범위로 분할하여 각 범위 별로 이용가능시간을 별도로 지정하거나 서비스의 전부 또는 일부를 본인확인 여부, 등록정보 유무, 기타 회사에서 정한 조건에 따라 차등적으로 제공할 수 있습니다.</Text>
                    <Text>또한 회사는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는 운영상 상당한 이유가 있는 경우 서비스의 제공을 일시적으로 중단할 수 있습니다. 이 경우 회사는 통지 방법으로 정해진 방식을 통해 회원께 통지합니다. 다만, 회사가 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에 통지할 수 있습니다. 그 밖에도 회사는 서비스 제공에 필요한 경우 정기점검을 실시할 수 있으며, 정기점검시간은 서비스 제공화면에 공지한 바에 따릅니다.</Text>
                    <Text style={styles.textHeader}>서비스는 때로 변경될 수도 있습니다.</Text>
                    <Text>회사는 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라 제공하고 있는 전부 또는 일부 서비스를 변경할 수 있습니다. 서비스의 내용, 이용방법, 이용시간에 대한 변경이 있는 경우에는 변경사유, 변경될 서비스의 내용 및 제공일자 등은 그 변경 전에 해당 서비스 내 공지사항 화면 등 회원이 충분히 인지할 수 있는 방법으로 게시합니다.</Text>
                    <Text style={styles.textHeader}>다양한 정보와 광고를 제공할 수 있습니다.</Text>
                    <Text>서비스를 이용하기 위해서는 광고를 보아야 하는 경우가 있습니다. 이는 회원에게 제공하는 다양한 서비스를 원칙적으로 무료로 제공할 수 있게하며, 새로운 연구와 개발에 투자하여 더 나은 서비스를 제공할 수 있는 기반이 됩니다.</Text>
                    <Text>회사는 회원이 서비스 이용 중 필요하다고 인정되는 다양한 정보를 공지사항이나 서비스 내 알림 등의 방법으로 제공할 수 있으며, 회원은 관련법에 따른 거래관련 정보 및 고객문의 등에 대한 답변 등을 제외하고는 언제든지 수신 거절을 할 수 있습니다. 다만, 회원에게 영리목적의 광고성 정보를 SMS등 전화 및 모사전송기기를 통해 전송하려고 하는 경우에는 회원의 사전 동의를 받아서 전송합니다.</Text>
                    <Text>또한 회사는 서비스의 운영과 관련하여 서비스 화면, 게시판, 홈페이지 등에 광고를 게재할 수 있습니다. 회원은 회사가 제공하는 서비스와 관련하여 게시물 또는 기타 정보를 변경, 수정, 제한하는 등의 조치를 취하지 않습니다.</Text>
                    <Text style={styles.textHeader}>언제든지 해지하실 수 있습니다.</Text>
                    <Text>회원은 언제든지 서비스 내 계정삭제 화면을 통하여 이용계약 해지 신청을 할 수 있으며, 회사는 관련법령 등이 정하는 바에 따라 이를 즉시 처리하겠습니다. 회원이 계약을 해지할 경우, 관련법 및 개인정보처리방침에 따라 회사가 회원정보를 보유하는 경우를 제외하고는 해지와 함께 회원의 모든 데이터는 소멸되며 이는 복구할 수 없습니다.</Text>
                    <Text>회원이 계약을 해지하는 경우, 프로필 사진 등과 같이 회원을 식별할 수 있는 본인계정에 등록 내용 일체는 삭제됩니다. 다만, 타인에 의해 담기 혹은 스크랩 등이 되어 재게시 되거나 공용게시판에 등록된 게시물 등은 삭제되지 않으니 사전에 삭제하신 후 탈퇴하시기 바랍니다.</Text>
                    <Text style={styles.textHeader}>서비스 운영에 대한 책임 중 몇가지 예외 사항이 있습니다.</Text>
                    <Text>회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제되며, 단말기 등 접근 매체의 분실로 인한 서비스 이용장애 등과 같이 회원의 귀책사유로 인한 서비스 이용의 장애 및 통신 장애 등에 대하여는 책임을 지지 않습니다.</Text>
                    <Text>또한 회원이 서비스와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용과 회원 사이 또는 회원이 제3자와 상호간에 서비스를 매개로 하여 거래 등을 한 경우에는 책임이 면제됩니다. 그 밖에도 무료로 제공되는 서비스 이용과 관련하여 관련법에 특별한 규정이 없는 한 책임을 지지 않습니다.</Text>
                    <Text style={styles.textHeader}>본 약관과 관련해 회사와 회원간에 제기된 소송은 대한민국법을 준거법으로 하며, 발생한 분쟁에 대해서는 민사소송법 상 정한 절차를 따릅니다.</Text>
                    <Text style={styles.textHeader}>시행일자 : 2018년 5월 2일</Text>
                </ScrollView>
            </Container>
        );
    }
}
const styles = StyleSheet.create({
    textHeader:{
        fontWeight:'bold', fontSize:15, marginBottom:10, marginTop:10
    },
});

export default TermsService;
